{
    "welcome": "Herzlich willkommen auf meinem Portfolio!",
    "hello": "Hallo!",
    "home": "Startseite",
    "about": "Über",
    "cv": "Lebenslauf",
    "education": "Ausbildung",
    "tech": "Technische Erfahrungen",
    "langs": "Sprachkenntnisse",
    "de": "Deutsch:",
    "de2": "mittleres Niveau",
    "en": "Englisch:",
    "en2": "fließend",
    "pe": "Persisch:",
    "pe2": "Muttersprache",
    "prog": "Programmierkenntnisse",
    "data": "Datenbankkenntnisse",
    "iam": "Ich bin Bahman, ein leidenschaftlicher und agiler Software-Ingenieur mit bewiesenen technischen und geschäftlichen Kenntnissen, durch 10 Jahre Erfahrung in Scrum und Agile Umgebungen als C#- und .NET-Entwickler mit Full-Stack Fähigkeiten.",
    "iam2": "Durch die Arbeit an vielen verschiedenen Projekten habe ich gute Fähigkeiten im Umgang mit Kunden entwickelt. Durch diese Projekte musste ich mich anderen Abteilungen als meinen unterschiedlichen Kunden stellen. Außerdem habe ich Erfahrung mit komplexen Arbeitsumgebungen und Support-Teams.",
    "iam3": "Als Entwickler habe ich durch analytische Techniken starke Fähigkeiten zur Problemlösung entwickelt; (mehr zu technischer Erfahrung)",
    "who": "Wer bin ich?",
    "name": "Ich heiße Bahman Soltani.",
    "about1": "Ich wurde in Isfahan im Iran geboren. Im September 2020 bin ich Nach Deutschland gekommen, Im September 2020 kam ich nach Deutschland, um an der IU Internationale Hochschule Englisch und Master of Computer Science zu studieren. Im Iran habe ich 10 Jahre Erfahrung als Backend-, Frontend- und Full-Stack-Entwickler und Software-Designer von C# und .NET Umgebung, Webentwicklung (ASP.NET MVC, .NET Core Web API, TypeScript, Angular, jQuery, JavaScript), Git, TFS, Jira, Sicherheit Programmierung und SQL Server.",
    "about2": "Von Dezember 2017 bis August 2020 arbeitete ich als Full-Stack Web Entwickler bei der Firma Khatsaz, um eine Web Applikation zu implementieren, indem ich ihre Desktop Applikation für ihre neuen Büros in verschiedenen Städten im Iran auf Web Applikation umgestellt habe. Ihre Desktop Version Applikation wurde von mir von Januar 2010 bis März 2016 als C#.NET Entwickler für die Personal- und Lagerverwaltung und andere Verwaltungstools implementiert.",
    "about3": "Bei der Firma Varanegar arbeitete ich von Juni 2016 bis November 2017 als Backend- und Frontend-Entwickler, damit ich eine Web Applikation zur Überprüfung der gefertigten Aufgaben in verschiedenen Abteilungen für Distributionsunternehmen fertiggestellt habe. Danach haben wir in einem anderen Team eine Desktop Applikation zur Kontrollierung der Workflows für das Liefersystem der Distributionsunternehmen implementiert. Dann haben wir in einem größeren Team eine Desktop Applikation für das Rabatt- und Bonus Management für Distributionsunternehmen implementiert.",
    "about4": "Und in Deutschland bei der Firma Texaid habe ich von Juli 2023 Bis Oktober 2023 als Full Stack Web Entwickler, um ein neue Applikation für Container Collection zu implementieren. Bei Udemy habe ich eine Woche lang Angular und TypeScript gelernt, um ihre Applikation zu implementieren.",
    "about5": "Durch die Arbeit in einem teamorientierten Umgebung und durch viele Projekte und Ausbildungen habe ich gute Kommunikations- und Interaktionsfähigkeiten entwickelt, die mir ermöglichen, die Bedürfnisse von Aufgaben zu entdecken und die täglichen Herausforderungen erfolgreich zu lösen.",
    "cvheader": "Berufliche Laufbahn",
    "cvheader2": "Einzelheiten zu den Erfahrungen",
    "jobtitle4": "Full Stack Web Entwickler (Home Office)",
    "job4date": "Juli 2023 bis November 2020",
    "job4ort": "Darmstadt, Deutschland",
    "job4detail1": "Arbeiten mit C#, Microsoft SQL Server, .NET Core Web Api, Entity Framework Core, Multitier Architektur, TypeScript, Angular, und Design-Patterns.",
    "jobtitle3": "Full Stack Web Entwickler",
    "job3date": "Dezember 2017 bis August 2020",
    "job3detail1": "Aktualisierung der Verwaltungssysteme wie Personal- und Lagerverwaltung des Büros von Windows auf webbasiert.",
    "job3detail2": "Schaffung und Analyse der Daten, um ein Geschäftsplan zu entwickeln, dass die Bedürfnisse des Büros erfüllt werden.",
    "job3detail3": "Arbeiten mit C#, SQL Server, ASP.NET MVC, JavaScript, jQuery, JSON, Entity Framework und Design-Patterns.",
    "jobtitle2": "Backend- und Frontend Entwickler",
    "job2date": "Juni 2016 bis November 2017",
    "job2detail1": "Fertigstellung webbasierten Applikation zur Überprüfung der beendeten Aufgaben in verschiedenen Abteilungen für Distributionsfirmen und Implementierung einer Desktop Applikation auf Basis der Webversion.",
    "job2detail2": "Implementierung Desktop-basierten Applikation zur Verwaltung und Überprüfung Prozesse von Workflows für Distributions Delivery System.",
    "job2detail3": "Implementierung einer Desktop-basierten Verwaltung Applikation für das Rabatt- und Bonus Verwaltung für die Buchhaltung des Hauptsystems.",
    "job2detail4": "Zusammenarbeiten mit Programmierern und Analysten, um von Spezifikationen für neue Systementwurfen einzustellen und Aktualisierung die Aufgaben des Projekts, die von anderen Abteilungen wie Datenbankverwaltung und Kundenservice definiert wurde, um sicherzustellen, dass die Bedürfnisse der Kunden erfüllt werden.",
    "job2detail5": "Arbeiten mit C#, SQL Server, Multitier Architektur, ASP.NET MVC, Entity Framework, ADO.NET, Postman, JavaScript jQuery, JSON, Telerik Kendo UI, und Design-Patterns.",
    "jobtitle1": "C#.NET Entwickler",
    "job1date": "Januar 2010 bis März 2016",
    "job1detail1": "Entwicklung und implementierung einer Windows-basierten Desktop Applikation für die Personal- und Lagerverwaltung des Büros.",
    "job1detail2": "Analysieren des Geschäfts, um sicherzustellen, dass die Bedürfnisse des Büros erfüllt werden.",
    "job1detail3": "Arbeiten mit C#, SQL Server, OOP, ADO.NET, Multitier Architektur und Objektpool als Design-Pattern.",
    "edutitle": "Studium",
    "edudetails": "Einzelheiten zum Studium",
    "iu": "IU Internationale Hochschule",
    "master": "Master in Informatik (Storniert)",
    "masterdate": "Oktober 2021 - August 2023",
    "bachelor": "Bachelor in Computer Engineering (Schwerpunkt: Software)",
    "bachelordate": "Januar 2011 – April 2014",
    "najafabad": "Azad Universität Najafabad",
    "associate": "Associate Degree in Informatik (Schwerpunkt: Software)",
    "associatedate": "Januar 2007 – Juni 2010",
    "associateuni": "Azad Universität Khomeinishahr",
    "cert": "Ausbildung",
    "certdetail": "Einzelheiten zur Ausbildung",
    "certdate5": "Juni 2023 – heute",
    "certdate4": "August 2009 – Oktober 2009",
    "certdate3": "Oktober 2012 – Dezember 2012",
    "certdate2": "August 2015 – Oktober 2015",
    "certdate1": "August 2008 – Oktober 2008",
    "metaco": "Trainingszentrum in Isfahan, Iran",
    "techtitle":"Technische Erfahrung Zusammenfassung",
    "async": "Asynchrone Programmierung",
    "multi": "Schichtenarchitektur (Multitier Architektur)",
    "socket": "Socket Programmierung",
    "Design-Patterns": "Design-Patterns",
    "database": "Datenbank",
    "control": "Versionsverwaltung",
    "projversion": "Projektverwaltung",
    "general": "Allgemeine Erfahrungen",
    "fast": "Schnelle Codierung",
    "legacy": "Legacy-Systeme",
    "agile": "Agile Methoden",
    "Germany": "Deutschland",
    "and": "und"

}