{
    "welcome": "Welcome to my Portfolio!",
    "hello": "Hello!",
    "home": "Home",
    "about": "About",
    "cv": "Resume",
    "education": "Education",
    "tech": "Technical Experiences",
    "langs": "Languages",
    "de": "German:",
    "de2": "Intermediate",
    "en": "English:",
    "en2": "Fluent",
    "pe": "Persian:",
    "pe2": "Mother tongue",
    "prog": "Programming skills",
    "data": "Database skills",
    "iam": "My name is Bahman, a passionate and agile Software Engineer with solid and proven technical and business knowledge, through 10 years of experience working in scrum and agile environments as a C# and .NET developer with full-stack skills.",
    "iam2": "I have developed good interpersonal and client-facing skills through various projects working with other departments as different customers and stakeholders. Familiar and experienced with complex working environments and supporting teams.",
    "iam3": "As a Developer, I have developed strong problem-solving skills with analytical techniques containing both methodical and organized; (more on technical experience)",
    "who": "Who am I?",
    "name": "My name is Bahman Soltani.",
    "about1": " I was originally born in Esfahan, Iran. Currently, I'm a student in Berlin studying for a Master of Computer Science at IU International University of Applied Science. In Iran, I worked as a back-end, front-end and full-stack developer and software designer specializing in C# and .NET environment, Web development (ASP.NET MVC, .NET Core Web API, TypeScript, Angular, jQuery, JavaScript), Git, TFS, Jira, Security programming, and SQL Server for 10 years.",
    "about2": "From December 2017 to August 2020, I worked as a .NET full-stack web developer at Khatsaz Company to implement a web application by inheriting their desktop version application for their new offices in different cities in Iran, which was already implemented myself from January 2010 to March 2016 as a C# .NET Full-stack developer there, for warehouse management, accounting, human resources, and other administrative tools.",
    "about3": "At Varanegar Pishro Company, from June 2016 to November 2017, I worked as a Back-end and Front-end Developer to complete a web-based application for reviewing the completed tasks in different departments for distribution companies and their merchants, and then in another team, to implement a desktop-based application for monitoring the process of the workflows for the distribution companies’ delivery system and then in a bigger team to implement a desktop-based application for discount and reward management for distribution companies.",
    "about4": "In Germany, I worked at Texaid from July 2023 to October 2023 as a Full Stack Web Developer to implement a new application for Container Collection Management. I learned Angular and TypeScript at Udemy in one week to implement their application.",
    "about5": "Having worked in a team-oriented setting and through many projects and training, I have developed excellent communication and interaction skills, which enable me to quickly understand the requirements and successfully tackle day-to-day challenges.",
    "cvheader": "Employment History",
    "cvheader2": "Experiences Details",
    "jobtitle5": "Senior Full Stack Developer",
    "job5date": "December 2023 to Present",
    "job5ort": "Rotenburg Wümme, Germany",
    "job5detail1": "Created different modules to speed up the booking.",
    "job5detail2": "Fetched information via PDF analysis, XML format, and etc. to make bookings.",
    "job5detail3": "Analyzed business data to create an optimized database and optimized application that meets the customer's requirements.",
    "job5detail4": "Worked with C#, Microsoft SQL Server, .NET Core, Web API, .NET Core Entity Framework, Multi-layered Architecture, Razor, jQuery, Dynamic Javascript, and Design Patterns.",
    
    "jobtitle4": "Full Stack Web Developer (Remote)",
    "job4date": "July 2023 to November 2020",
    "job4ort": "Darmstadt, Germany",
    "job4detail1": "Worked with C#, Microsoft SQL Server, .NET Core Web API, Entity Framework Core, Multi-layered Architecture, TypeScript, Angular, and Design Patterns.",
    "jobtitle3": "Full-stack Web Developer",
    "job3date": "December 2017 to August 2020",
    "job3detail1": "Upgraded the office's application of administration, staff, and warehouse management systems from Windows desktop to web-based.",
    "job3detail2": "Architected and analyzed data to develop a practical business plan that meets the office’s requirements and expectations.",
    "job3detail3": "Worked with C#, SQL Server, ASP.NET MVC, JavaScript, jQuery, JSON, Entity Framework and Design Patterns.",
    "jobtitle2": "Backend and Frontend Developer",
    "job2date": "June 2016 to November 2017",
    "job2detail1":"Completed a web-based application for reviewing the completed jobs in different departments for distribution companies and implemented a desktop version application based on the web version.",
    "job2detail2":"Implemented a desktop-based application for monitoring the process of the workflows for the distribution delivery system.",
    "job2detail3":"Implemented a desktop-based administrating application for discount and reward management for the accounting department of the main system.",
    "job2detail4":"Collaborated based on the Agile method with programmers and analysts to set specifications for new system designs and kept the project updated for the tasks defined by other departments including database administration and customer service to ensure the clients' requirements were met.",
    "job2detail5": "Worked with C#, SQL Server, Multi-layered Architecture, ASP.NET MVC, WCF, Asynchronous Programming, Postman, Entity Framework, ADO.NET, JavaScript, jQuery, JSON, Telerik Kendo UI, Crystal Reports, and Design Patterns.",
    "jobtitle1": "C#.NET Developer",
    "job1date": "January 2010 to March 2016",
    "job1detail1": "Developed and implemented a desktop application for the company's administration system including staff management and warehouse management.",
    "job1detail2": "Analyzed the business to ensure office’s needs are captured.",
    "job1detail3": "Worked with C#, SQL Server, ADO.NET, OOP, Multi-layered Architecture, and Object Pool as Design Pattern.",
    "edutitle": "Education",
    "edudetails": "Education's details",
    "iu": "IU International University of Applied Sciences",
    "master": "Master in Computer Science (Cancelled)",
    "masterdate": "October 2021 - August 2023",
    "bachelor": "Bachelor in Software Engineering",
    "bachelordate": "January 2011 – April 2014",
    "najafabad": "Azad University of Najafabad",
    "associate": "Associate Degree in Computer Science",
    "associatedate": "January 2007 – June 2010",
    "associateuni": "Azad University of Khomeinishahr",
    "cert": "Certificates",
    "certdetail": "Certificates' details",
    "certdate5": "June 2023 – Present",
    "certdate4": "August 2009 – October 2009",
    "certdate3": "October 2012 – December 2012",
    "certdate2": "August 2015 – October 2015",
    "certdate1": "August 2008 – October 2008",
    "metaco": "Training center in Isfahan, Iran",
    "techtitle":"Technical Experience Summary",
    "async": "Asynchronous Programming",
    "multi": "Multi-layered Architecture",
    "socket": "Socket Programming",
    "Design-Patterns": "Design Patterns",
    "database": "Database",
    "control": "Source Control",
    "projversion": "Project Management",
    "general": "General",
    "fast": "Fast Coding",
    "legacy": "Legacy Systems",
    "agile": "Agile Methods",
    "Germany": "Germany",
    "and": "and"

}
